package edu;

public class Test2 {

	public static void main(String[] args) {
		int depositAmount;
		depositAmount = 50000;
		System.out.println((depositAmount));
		
		System.out.println("Hello, 안녕!");
		System.out.print("Hello, 안녕!\n");
		// TODO Auto-generated method stub

		// 고객3만원 출금
		// 은행 시스템 저장된 고객파일에서 출금계좌정보 찾음
		// 찾은 계좌의 잔액 얼마인지 파악
		// 잔액이 10만원이면 인출가능
		// 인출 후 잔액 7만원으로 변경해야 함
		// "10-3=7" 계산식 결과값 출력 위해 3단계
		
		// 10 기억하기, 3 기억하기, 둘을 연산하기
		
		
		// 메모리에 데이터 저장하는 방식 2가지
		// 프로그램 실행동안만 저장하는 것 > 일반적으로 프로그램이 사용하는 메모리에 저장함
		// 프로그램 실행 종료 후 저장상태 계속 유지하는 것 > 데이터를 파일로 저장해야 함
		
		
		// 프로그램 사용동안만 메모리에 저장하는 방법 먼저 study
		// 변수-데이터를 저장하는 메모리의 일정 공간, 이 메모리공간에 이름지정 가능, 변수 a or 변수 b
		int a = 10; // 변수 a 를 선언함 = 저장할 메모리 공간을 a 라는 이름으로 지정함
		int b = 3;  // 변수 b 를 선언함 = 저장할 메모리 공간을 b 라는 이름으로 지정함
		// 메모리 특정공간에 비름붙이면(=변수선언하면) 데이터 불러올 때 메모리 이름만 사용하면 됨
		// 변수선언되면, 변수이름만 써도 해당 데이터 접근가능
		// 명령어 (a - b)를 만나면, 메모리에서 변수a,변수b 찾아가서 10, 3을 가져와 뺄셈을 수행함
		
		// 변수선언(=변수생성)하고, 사용할 때는 변수이름으로 접근(꺼내씀)
		// 변수생성=자바언어로, 데이터타입별로 사용
		// 변수 이름 규칙 6개(p.61참고)
		// ㅁ 첫 글자는 '문자', '\_', "$' 중 하나로 시작해야 함 <--- 숫자로 시작 불가
		// ㅁ 첫 글자는 소문자(관례)
		// ㅁ 공백 불가
		// ㅁ 대소문자 구분됨
		// ㅁ 길이 무제한
		// ㅁ 예약어 사용 불가 ---> reserved word : 프로그램 언어에서 내부적으로 기능이 정해져 있는 단어들
		
		// (참고: 자바 데이터 타입, 변수, 배열(Catsbi's DLog))
		//		ㄴ https://catsbi.oopy.io/6541026f-1e19-4117-8fef-aea145e4fc1b
		
		
		
		
		
		
		
		
		
		
		
	}

}
 